       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANK-MENU.

       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "Banking Demo"
           STOP RUN.
