       IDENTIFICATION DIVISION.
       PROGRAM-ID. CREATE-USER.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT USERS-IN ASSIGN TO "data/users.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT USERS-OUT ASSIGN TO "data/users.tmp"
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD USERS-IN.
       01 USERS-IN-RECORD PIC X(200).

       FD USERS-OUT.
       01 USERS-OUT-RECORD PIC X(200).

       WORKING-STORAGE SECTION.
       01 USERS-EOF-FLAG PIC X VALUE "N".
       01 USER-EXISTS-FLAG PIC X VALUE "N".

       01 NEW-USER-ID PIC X(10).
       01 NEW-USER-NAME PIC X(40).
       01 NEW-USER-ADDRESS PIC X(80).
       01 NEW-USER-CITY PIC X(40).
       01 NEW-USER-STATE PIC X(2).
       01 NEW-USER-ZIPCODE PIC X(5).
       01 NEW-USER-DOB PIC X(10).
       01 NEW-USER-PHONE PIC X(12).

       01 USER-ID PIC X(10).

       01 SYSTEM-COMMAND PIC X(200).

       PROCEDURE DIVISION.
       MAIN.
           DISPLAY SPACE
           DISPLAY "CREATE USER"
           DISPLAY "-----------"
           DISPLAY SPACE
           DISPLAY "USER INFORMATION"
           DISPLAY "----------------"
           DISPLAY "ID: " WITH NO ADVANCING
           ACCEPT NEW-USER-ID

           DISPLAY "NAME: " WITH NO ADVANCING
           ACCEPT NEW-USER-NAME

           DISPLAY "ADDRESS: " WITH NO ADVANCING
           ACCEPT NEW-USER-ADDRESS

           DISPLAY "CITY: " WITH NO ADVANCING
           ACCEPT NEW-USER-CITY

           DISPLAY "STATE: " WITH NO ADVANCING
           ACCEPT NEW-USER-STATE

           DISPLAY "ZIPCODE: " WITH NO ADVANCING
           ACCEPT NEW-USER-ZIPCODE

           DISPLAY "DOB (MM-DD-YYYY): " WITH NO ADVANCING
           ACCEPT NEW-USER-DOB

           DISPLAY "PHONE NUMBER (XXX-XXX-XXXX): " WITH NO ADVANCING
           ACCEPT NEW-USER-PHONE

           PERFORM VALIDATE-INPUT

           PERFORM CREATE-USER-RECORD

           IF USER-EXISTS-FLAG = "Y"
               DISPLAY "USER ID ALREADY EXISTS."
           ELSE
               DISPLAY "USER CREATED."
           END-IF
           STOP RUN.

       CREATE-USER-RECORD.
           MOVE "N" TO USERS-EOF-FLAG USER-EXISTS-FLAG
           OPEN INPUT USERS-IN
           OPEN OUTPUT USERS-OUT

           PERFORM UNTIL USERS-EOF-FLAG = "Y"
           READ USERS-IN
           AT END
               MOVE "Y" TO USERS-EOF-FLAG
           NOT AT END
               UNSTRING USERS-IN-RECORD DELIMITED BY ","
               INTO USER-ID
               END-UNSTRING
               IF FUNCTION TRIM(USER-ID) = NEW-USER-ID
                   MOVE "Y" TO USER-EXISTS-FLAG
               END-IF
               MOVE USERS-IN-RECORD TO USERS-OUT-RECORD
               WRITE USERS-OUT-RECORD
           END-READ
           END-PERFORM

           IF USER-EXISTS-FLAG NOT = "Y"
               PERFORM BUILD-USER-OUT-RECORD
               WRITE USERS-OUT-RECORD
           END-IF

           CLOSE USERS-IN
           CLOSE USERS-OUT

           MOVE "mv -f data/users.tmp data/users.dat" TO SYSTEM-COMMAND
           CALL "SYSTEM" USING SYSTEM-COMMAND.

       VALIDATE-INPUT.
           MOVE FUNCTION TRIM(NEW-USER-ID) TO NEW-USER-ID
           MOVE FUNCTION TRIM(NEW-USER-NAME) TO NEW-USER-NAME
           MOVE FUNCTION TRIM(NEW-USER-ADDRESS) TO NEW-USER-ADDRESS
           MOVE FUNCTION TRIM(NEW-USER-CITY) TO NEW-USER-CITY
           MOVE FUNCTION TRIM(NEW-USER-STATE) TO NEW-USER-STATE
           MOVE FUNCTION TRIM(NEW-USER-ZIPCODE) TO NEW-USER-ZIPCODE
           MOVE FUNCTION TRIM(NEW-USER-DOB) TO NEW-USER-DOB
           MOVE FUNCTION TRIM(NEW-USER-PHONE) TO NEW-USER-PHONE

           IF NEW-USER-ID = SPACES
               DISPLAY "ID IS REQUIRED."
               STOP RUN
           END-IF

           IF NEW-USER-NAME = SPACES
               DISPLAY "NAME IS REQUIRED."
               STOP RUN
           END-IF

           IF NEW-USER-ADDRESS = SPACES
               DISPLAY "ADDRESS IS REQUIRED."
               STOP RUN
           END-IF

           IF NEW-USER-CITY = SPACES
               DISPLAY "CITY IS REQUIRED."
               STOP RUN
           END-IF

           IF NEW-USER-STATE = SPACES
               DISPLAY "STATE IS REQUIRED."
               STOP RUN
           END-IF

           IF NEW-USER-ZIPCODE = SPACES
               DISPLAY "ZIPCODE IS REQUIRED."
               STOP RUN
           END-IF

           IF NEW-USER-DOB = SPACES
               DISPLAY "DATE OF BIRTH IS REQUIRED."
               STOP RUN
           END-IF

           IF NEW-USER-PHONE = SPACES
               DISPLAY "PHONE NUMBER IS REQUIRED."
               STOP RUN
           END-IF.

       BUILD-USER-OUT-RECORD.
           MOVE SPACES TO USERS-OUT-RECORD
           STRING
           FUNCTION TRIM(NEW-USER-ID) DELIMITED BY SIZE
           "," DELIMITED BY SIZE
           FUNCTION TRIM(NEW-USER-NAME) DELIMITED BY SIZE
           "," DELIMITED BY SIZE
           FUNCTION TRIM(NEW-USER-ADDRESS) DELIMITED BY SIZE
           "," DELIMITED BY SIZE
           FUNCTION TRIM(NEW-USER-CITY) DELIMITED BY SIZE
           "," DELIMITED BY SIZE
           FUNCTION TRIM(NEW-USER-STATE) DELIMITED BY SIZE
           "," DELIMITED BY SIZE
           FUNCTION TRIM(NEW-USER-ZIPCODE) DELIMITED BY SIZE
           "," DELIMITED BY SIZE
           FUNCTION TRIM(NEW-USER-DOB) DELIMITED BY SIZE
           "," DELIMITED BY SIZE
           FUNCTION TRIM(NEW-USER-PHONE) DELIMITED BY SIZE
           INTO USERS-OUT-RECORD
           END-STRING.
           